Revit 2027 API
ExportLineweightTable.GetEnumerator Method
Returns an enumerator that iterates through a collection.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual IEnumerator<KeyValuePair<ExportLineweightKey, ExportLineweightInfo>> GetEnumerator()
Public Overridable Function GetEnumerator As IEnumerator(Of KeyValuePair(Of ExportLineweightKey, ExportLineweightInfo))
public:
virtual IEnumerator<KeyValuePair<ExportLineweightKey^, ExportLineweightInfo^>>^ GetEnumerator()
abstract GetEnumerator : unit -> IEnumerator<KeyValuePair<ExportLineweightKey, ExportLineweightInfo>>
override GetEnumerator : unit -> IEnumerator<KeyValuePair<ExportLineweightKey, ExportLineweightInfo>>
Return Value
IEnumerator<KeyValuePair<ExportLineweightKey, ExportLineweightInfo>>
An IEnumerator object that can be used to iterate through the collection.
Implements
IEnumerable<T>.GetEnumerator()
See Also
Reference
ExportLineweightTable Class
Autodesk.Revit.DB Namespace